{"class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, null, 1], "name": "audio_input", "sparse": false}, "inbound_nodes": [], "name": "audio_input"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, null, 1], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "Conv1D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [64]}, "name": "conv1d_1"}, {"class_name": "Activation", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "config": {"activation": "tanh", "trainable": true, "name": "activation_1"}, "name": "activation_1"}, {"class_name": "Conv1D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [64]}, "name": "conv1d_2"}, {"class_name": "Activation", "inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "config": {"activation": "tanh", "trainable": true, "name": "activation_2"}, "name": "activation_2"}, {"class_name": "Conv1D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [64]}, "name": "conv1d_3"}, {"class_name": "Activation", "inbound_nodes": [[["conv1d_3", 0, 0, {}]]], "config": {"activation": "tanh", "trainable": true, "name": "activation_3"}, "name": "activation_3"}, {"class_name": "Conv1D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [64]}, "name": "conv1d_4"}, {"class_name": "Activation", "inbound_nodes": [[["conv1d_4", 0, 0, {}]]], "config": {"activation": "tanh", "trainable": true, "name": "activation_4"}, "name": "activation_4"}, {"class_name": "Reshape", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"target_shape": [-1, 1, 128], "trainable": true, "name": "reshape_1"}, "name": "reshape_1"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"output_padding": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_transpose_1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [64, 1]}, "name": "conv2d_transpose_1"}, {"class_name": "Reshape", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "config": {"target_shape": [-1, 128], "trainable": true, "name": "reshape_2"}, "name": "reshape_2"}, {"class_name": "Activation", "inbound_nodes": [[["reshape_2", 0, 0, {}]]], "config": {"activation": "tanh", "trainable": true, "name": "activation_5"}, "name": "activation_5"}, {"class_name": "Concatenate", "inbound_nodes": [[["activation_5", 0, 0, {}], ["conv1d_3", 0, 0, {}]]], "config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "name": "concatenate_1"}, {"class_name": "Reshape", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"target_shape": [-1, 1, 256], "trainable": true, "name": "reshape_3"}, "name": "reshape_3"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["reshape_3", 0, 0, {}]]], "config": {"output_padding": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_transpose_2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [64, 1]}, "name": "conv2d_transpose_2"}, {"class_name": "Reshape", "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]], "config": {"target_shape": [-1, 128], "trainable": true, "name": "reshape_4"}, "name": "reshape_4"}, {"class_name": "Activation", "inbound_nodes": [[["reshape_4", 0, 0, {}]]], "config": {"activation": "tanh", "trainable": true, "name": "activation_6"}, "name": "activation_6"}, {"class_name": "Concatenate", "inbound_nodes": [[["activation_6", 0, 0, {}], ["conv1d_2", 0, 0, {}]]], "config": {"trainable": true, "name": "concatenate_2", "axis": -1}, "name": "concatenate_2"}, {"class_name": "Reshape", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "config": {"target_shape": [-1, 1, 256], "trainable": true, "name": "reshape_5"}, "name": "reshape_5"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["reshape_5", 0, 0, {}]]], "config": {"output_padding": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_transpose_3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [64, 1]}, "name": "conv2d_transpose_3"}, {"class_name": "Reshape", "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}]]], "config": {"target_shape": [-1, 128], "trainable": true, "name": "reshape_6"}, "name": "reshape_6"}, {"class_name": "Activation", "inbound_nodes": [[["reshape_6", 0, 0, {}]]], "config": {"activation": "tanh", "trainable": true, "name": "activation_7"}, "name": "activation_7"}, {"class_name": "Concatenate", "inbound_nodes": [[["activation_7", 0, 0, {}], ["conv1d_1", 0, 0, {}]]], "config": {"trainable": true, "name": "concatenate_3", "axis": -1}, "name": "concatenate_3"}, {"class_name": "Reshape", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "config": {"target_shape": [-1, 1, 256], "trainable": true, "name": "reshape_7"}, "name": "reshape_7"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["reshape_7", 0, 0, {}]]], "config": {"output_padding": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_transpose_4", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 201, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [64, 1]}, "name": "conv2d_transpose_4"}, {"class_name": "Reshape", "inbound_nodes": [[["conv2d_transpose_4", 0, 0, {}]]], "config": {"target_shape": [-1, 201], "trainable": true, "name": "g_output"}, "name": "g_output"}, {"class_name": "Cropping1D", "inbound_nodes": [[["g_output", 0, 0, {}]]], "config": {"cropping": [256, 256], "trainable": true, "name": "cropping1d_1"}, "name": "cropping1d_1"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["cropping1d_1", 0, 0]]}, "inbound_nodes": [[["audio_input", 0, 0, {}]]], "name": "model_1"}], "input_layers": [["audio_input", 0, 0]], "output_layers": [["model_1", 1, 0]], "name": "model_2"}, "backend": "tensorflow"}